# CannotCopyAttachedTypeWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyAttachedTypeWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot copy attached detail group type without copying the model group type it refers to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyAttachedTypeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyAttachedTypeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyAttachedTypeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace